; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v7)
             (pred_11 ?v12 ?v4)
             (pred_6 ?v1 ?v4)
             (pred_7 ?v13 ?v1 )
	     (pred_8 ?v1)
             (pred_5 ?v8)
             (pred_1 ?v12)
             (pred_2 ?v4)
             (pred_12 ?v1)
             (pred_4 ?v12)
             (pred_10 ?v1)
             (pred_9 ))



(:action op_5
:parameters (?v9 ?v10 ?v3 ?v11)
:precondition (and (pred_5 ?v9) (pred_5 ?v10) (pred_1 ?v3) (pred_2 ?v11)
          (pred_3 ?v9 ?v10) (pred_11 ?v3 ?v11)
                   (pred_6 ?v10 ?v11) (pred_8 ?v9) 
                   (pred_12 ?v10) (pred_4 ?v3))
:effect (and  (pred_10 ?v10) (not (pred_12 ?v10))))


(:action op_2
:parameters (?v9 ?v5)
:precondition (and (pred_5 ?v9) (pred_5 ?v5)
               (pred_8 ?v9) (pred_3 ?v9 ?v5) (pred_10 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v9))))

(:action op_4
:parameters (?v9 ?v3)
:precondition (and (pred_5 ?v9) (pred_1 ?v3) 
                  (pred_8 ?v9) (pred_7 ?v3 ?v9) (pred_9 ))
:effect (and (pred_4 ?v3)
   (not (pred_7 ?v3 ?v9)) (not (pred_9 ))))


(:action op_3
:parameters (?v9 ?v6 ?v2)
:precondition (and (pred_5 ?v9) (pred_1 ?v6) (pred_1 ?v2)
                  (pred_8 ?v9) (pred_4 ?v2) (pred_7 ?v6 ?v9))
:effect (and (pred_4 ?v6) (pred_7 ?v2 ?v9)
        (not (pred_4 ?v2)) (not (pred_7 ?v6 ?v9))))

(:action op_1
:parameters (?v9 ?v3)
:precondition (and (pred_5 ?v9) (pred_1 ?v3) 
                  (pred_8 ?v9) (pred_4 ?v3))
:effect (and (pred_9 ) (pred_7 ?v3 ?v9) (not (pred_4 ?v3)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_20 obj_01 obj_02 obj_13 obj_12 obj_11 obj_10 obj_19 obj_15 obj_08 obj_03 obj_07 obj_16 obj_21 obj_04 obj_18
    obj_09 obj_14
    obj_05 obj_06 obj_17
    )

    (:init
       (pred_9)

       (pred_5 obj_20)
       (pred_5 obj_01)
       (pred_5 obj_02)
       (pred_5 obj_13)
       (pred_5 obj_12)
       (pred_5 obj_11)
       (pred_5 obj_10)
       (pred_5 obj_19)
       (pred_5 obj_15)
       (pred_5 obj_08)
       (pred_5 obj_03)
       (pred_5 obj_07)
       (pred_5 obj_16)
       (pred_5 obj_21)
       (pred_5 obj_04)
       (pred_5 obj_18)
       (pred_2 obj_09)
       (pred_2 obj_14)
       (pred_1 obj_05)
       (pred_1 obj_06)
       (pred_1 obj_17)

       (pred_3 obj_20 obj_12)
       (pred_3 obj_20 obj_01)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_01 obj_02)
       (pred_3 obj_01 obj_20)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_02 obj_13)
       (pred_3 obj_02 obj_01)
       (pred_3 obj_13 obj_19)
       (pred_3 obj_13 obj_02)
       (pred_3 obj_12 obj_15)
       (pred_3 obj_12 obj_11)
       (pred_3 obj_12 obj_20)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_11 obj_10)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_12)
       (pred_3 obj_10 obj_03)
       (pred_3 obj_10 obj_19)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_10 obj_11)
       (pred_3 obj_19 obj_07)
       (pred_3 obj_19 obj_13)
       (pred_3 obj_19 obj_10)
       (pred_3 obj_15 obj_16)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_12)
       (pred_3 obj_08 obj_21)
       (pred_3 obj_08 obj_03)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_03 obj_04)
       (pred_3 obj_03 obj_07)
       (pred_3 obj_03 obj_10)
       (pred_3 obj_03 obj_08)
       (pred_3 obj_07 obj_18)
       (pred_3 obj_07 obj_19)
       (pred_3 obj_07 obj_03)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_16 obj_15)
       (pred_3 obj_21 obj_04)
       (pred_3 obj_21 obj_08)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_04 obj_18)
       (pred_3 obj_04 obj_03)
       (pred_3 obj_04 obj_21)
       (pred_3 obj_18 obj_07)
       (pred_3 obj_18 obj_04)
       (pred_12 obj_13)
       (pred_12 obj_04)
       (pred_12 obj_11)
       (pred_6  obj_13 obj_09)
       (pred_6  obj_04 obj_14)
       (pred_6  obj_11 obj_14)
       (pred_10 obj_20)
       (pred_10 obj_01)
       (pred_10 obj_02)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_10 obj_08)
       (pred_10 obj_03)
       (pred_10 obj_07)
       (pred_10 obj_16)
       (pred_10 obj_21)
       (pred_10 obj_18)

       (pred_11  obj_05 obj_09)
       (pred_11  obj_06 obj_14)
       (pred_11  obj_17 obj_14)
       (pred_7 obj_05 obj_12)
       (pred_7 obj_06 obj_20)
       (pred_7 obj_17 obj_19)
       (pred_8 obj_03)
    )

    (:goal (and
       (pred_7 obj_05 obj_16)
       (pred_7 obj_06 obj_02)
       (pred_7 obj_17 obj_15)
    ))
(:constraints
  (always (not (pred_8 obj_01)))
)
)

; plan
1. (op_2 obj_03 obj_08)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_08)
   goals met: 0 of 3
2. (op_2 obj_08 obj_15)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_15)
   goals met: 0 of 3
3. (op_2 obj_15 obj_12)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_12)
   goals met: 0 of 3
4. (op_4 obj_12 obj_05)
   deleted: (pred_7 obj_05 obj_12) (pred_9)
   added: (pred_4 obj_05)
   goals met: 0 of 3
5. (op_2 obj_12 obj_15)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_15)
   goals met: 0 of 3
6. (op_1 obj_15 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_9) (pred_7 obj_05 obj_15)
   goals met: 0 of 3
7. (op_2 obj_15 obj_12)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_12)
   goals met: 0 of 3
8. (op_2 obj_12 obj_20)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_20)
   goals met: 0 of 3
9. (op_4 obj_20 obj_06)
   deleted: (pred_7 obj_06 obj_20) (pred_9)
   added: (pred_4 obj_06)
   goals met: 0 of 3
10. (op_2 obj_20 obj_12)
   deleted: (pred_8 obj_20)
   added: (pred_8 obj_12)
   goals met: 0 of 3
11. (op_2 obj_12 obj_15)
   deleted: (pred_8 obj_12)
   added: (pred_8 obj_15)
   goals met: 0 of 3
12. (op_2 obj_15 obj_08)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_08)
   goals met: 0 of 3
13. (op_2 obj_08 obj_03)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_03)
   goals met: 0 of 3
14. (op_2 obj_03 obj_10)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_10)
   goals met: 0 of 3
15. (op_2 obj_10 obj_02)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_02)
   goals met: 0 of 3
16. (op_1 obj_02 obj_06)
   deleted: (pred_4 obj_06)
   added: (pred_9) (pred_7 obj_06 obj_02)
   goals met: 1 of 3
17. (op_2 obj_02 obj_10)
   deleted: (pred_8 obj_02)
   added: (pred_8 obj_10)
   goals met: 1 of 3
18. (op_2 obj_10 obj_19)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_19)
   goals met: 1 of 3
19. (op_4 obj_19 obj_17)
   deleted: (pred_7 obj_17 obj_19) (pred_9)
   added: (pred_4 obj_17)
   goals met: 1 of 3
20. (op_2 obj_19 obj_10)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_10)
   goals met: 1 of 3
21. (op_2 obj_10 obj_03)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_03)
   goals met: 1 of 3
22. (op_2 obj_03 obj_08)
   deleted: (pred_8 obj_03)
   added: (pred_8 obj_08)
   goals met: 1 of 3
23. (op_2 obj_08 obj_15)
   deleted: (pred_8 obj_08)
   added: (pred_8 obj_15)
   goals met: 1 of 3
24. (op_3 obj_15 obj_05 obj_17)
   deleted: (pred_4 obj_17) (pred_7 obj_05 obj_15)
   added: (pred_4 obj_05) (pred_7 obj_17 obj_15)
   goals met: 2 of 3
25. (op_2 obj_15 obj_16)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_16)
   goals met: 2 of 3
26. (op_1 obj_16 obj_05)
   deleted: (pred_4 obj_05)
   added: (pred_9) (pred_7 obj_05 obj_16)
   goals met: 3 of 3
